{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "weather_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///C:/Users/Admin/Desktop/WeatherRag/Data.csv' AS row\n",
    "WITH row,\n",
    "     split(row.Date, \"/\") AS dateParts\n",
    "CREATE (w:weatherDate {\n",
    "    Year: toInteger(row.Year),\n",
    "    Month: toInteger(row.Month),\n",
    "    Tmax: toFloat(row.Tmax),\n",
    "    Tmin: toFloat(row.Tmin),\n",
    "    AF: toFloat(row.AF),\n",
    "    Rain: toFloat(row.Rain),\n",
    "    Sun: toFloat(row.Sun),\n",
    "    Date: date(dateParts[2] + \"-\" + dateParts[1] + \"-\" + dateParts[0]),\n",
    "    Tmean: toFloat(row.Tmean)\n",
    "  \n",
    "})\n",
    "  RETURN row.Year\n",
    "    LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "graph.query(weather_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "weather_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///C:/Users/Admin/Desktop/WeatherRag/Data.csv' AS row\n",
    "WITH row,\n",
    "   toInteger(coalesce(trim(row.Year), '0')) AS year,\n",
    "    toInteger(coalesce(trim(row.Month), '0')) AS month,\n",
    "    toFloat(coalesce(trim(row.Tmax), '0')) AS tmax,\n",
    "    toFloat(coalesce(trim(row.Tmin), '0')) AS tmin,\n",
    "    toFloat(coalesce(trim(row.AF), '0')) AS af,\n",
    "    toFloat(coalesce(trim(row.Rain), '0')) AS rain,\n",
    "    toFloat(coalesce(trim(row.Sun), '0')) AS sun,\n",
    "    split(coalesce(trim(row.Date), '01/01/1970'), \"/\") AS dateParts,\n",
    "    toFloat(coalesce(trim(row.Tmean), '0')) AS tmean\n",
    "\n",
    "MERGE (y:Year {year:year})\n",
    "MERGE (m:Month {month: month, name: CASE month\n",
    "    WHEN 1 THEN 'January' \n",
    "    WHEN 2 THEN 'February' \n",
    "    WHEN 3 THEN 'March' \n",
    "    WHEN 4 THEN 'April' \n",
    "    WHEN 5 THEN 'May' \n",
    "    WHEN 6 THEN 'June' \n",
    "    WHEN 7 THEN 'July' \n",
    "    WHEN 8 THEN 'August' \n",
    "    WHEN 9 THEN 'September' \n",
    "    WHEN 10 THEN 'October' \n",
    "    WHEN 11 THEN 'November' \n",
    "    WHEN 12 THEN 'December' \n",
    "    END,\n",
    "\n",
    "    Tmax: tmax,\n",
    "    Tmin: tmin,\n",
    "    AF: af,\n",
    "    Rain: rain,\n",
    "    Sun: sun,\n",
    "    Tmean: tmean,\n",
    "    Date: date(dateParts[2] + \"-\" + dateParts[1] + \"-\" + dateParts[0])\n",
    "\n",
    "    })\n",
    "\n",
    "MERGE (y)-[:HAS_MONTH]->(m)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "graph.query(weather_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SEARCH QUERIES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Month': 'January',\n",
       "  'MaxTemperature': -0.1,\n",
       "  'MinTemperature': -5.7,\n",
       "  'Rainfall': 24.7,\n",
       "  'Sunlight': 58.0,\n",
       "  'MeanTemperature': -2.9},\n",
       " {'Month': 'February',\n",
       "  'MaxTemperature': 1.2,\n",
       "  'MinTemperature': -3.5,\n",
       "  'Rainfall': 13.2,\n",
       "  'Sunlight': 59.0,\n",
       "  'MeanTemperature': -1.15},\n",
       " {'Month': 'March',\n",
       "  'MaxTemperature': 9.9,\n",
       "  'MinTemperature': 2.8,\n",
       "  'Rainfall': 50.3,\n",
       "  'Sunlight': 102.6,\n",
       "  'MeanTemperature': 6.35},\n",
       " {'Month': 'April',\n",
       "  'MaxTemperature': 13.4,\n",
       "  'MinTemperature': 4.7,\n",
       "  'Rainfall': 41.0,\n",
       "  'Sunlight': 124.9,\n",
       "  'MeanTemperature': 9.05},\n",
       " {'Month': 'May',\n",
       "  'MaxTemperature': 15.8,\n",
       "  'MinTemperature': 6.3,\n",
       "  'Rainfall': 43.5,\n",
       "  'Sunlight': 189.5,\n",
       "  'MeanTemperature': 11.05},\n",
       " {'Month': 'June',\n",
       "  'MaxTemperature': 20.6,\n",
       "  'MinTemperature': 10.0,\n",
       "  'Rainfall': 43.0,\n",
       "  'Sunlight': 201.8,\n",
       "  'MeanTemperature': 15.3},\n",
       " {'Month': 'July',\n",
       "  'MaxTemperature': 20.6,\n",
       "  'MinTemperature': 10.6,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 170.1,\n",
       "  'MeanTemperature': 15.6},\n",
       " {'Month': 'August',\n",
       "  'MaxTemperature': 19.0,\n",
       "  'MinTemperature': 10.6,\n",
       "  'Rainfall': 100.4,\n",
       "  'Sunlight': 119.6,\n",
       "  'MeanTemperature': 14.8},\n",
       " {'Month': 'September',\n",
       "  'MaxTemperature': 17.9,\n",
       "  'MinTemperature': 9.3,\n",
       "  'Rainfall': 44.1,\n",
       "  'Sunlight': 134.0,\n",
       "  'MeanTemperature': 13.6},\n",
       " {'Month': 'October',\n",
       "  'MaxTemperature': 14.3,\n",
       "  'MinTemperature': 8.0,\n",
       "  'Rainfall': 48.6,\n",
       "  'Sunlight': 78.4,\n",
       "  'MeanTemperature': 11.15},\n",
       " {'Month': 'November',\n",
       "  'MaxTemperature': 11.4,\n",
       "  'MinTemperature': 5.2,\n",
       "  'Rainfall': 78.6,\n",
       "  'Sunlight': 52.8,\n",
       "  'MeanTemperature': 8.3},\n",
       " {'Month': 'December',\n",
       "  'MaxTemperature': 5.0,\n",
       "  'MinTemperature': -0.7,\n",
       "  'Rainfall': 11.1,\n",
       "  'Sunlight': 48.7,\n",
       "  'MeanTemperature': 2.15}]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Get all weather data for a specific year:\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year {year: 1963})-[:HAS_MONTH]->(m:Month)\n",
    "RETURN m.name AS Month, m.Tmax AS MaxTemperature, m.Tmin AS MinTemperature, m.Rain AS Rainfall, m.Sun AS Sunlight, m.Tmean AS MeanTemperature\n",
    "ORDER BY m.month\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'month': 'August', 'Rainfall': 100.4}]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#maximum rain in a month of specific year\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year {year: 1963})-[:HAS_MONTH]->(m:Month)\n",
    "Return m.name as month, m.Rain as Rainfall \n",
    "ORDER BY m.Rain DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Year': 1963, 'AverageTemperature': 8.608333333333334}]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Calculate the average temperature for a specific year:\n",
    "search_query = \"\"\"\n",
    "MATCH(y:Year {year:1963})-[:HAS_MONTH]->(m:Month) \n",
    "return y.year As Year, avg(m.Tmean) AS AverageTemperature\n",
    "\"\"\"\n",
    "graph.query(search_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Year': 1959,\n",
       "  'MaxTemperature': 4.4,\n",
       "  'MinTemperature': -1.4,\n",
       "  'Rainfall': 0.0,\n",
       "  'Sunlight': 78.1,\n",
       "  'MeanTemperature': 1.5},\n",
       " {'Year': 1960,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 0.0,\n",
       "  'Sunlight': 36.3,\n",
       "  'MeanTemperature': 4.15},\n",
       " {'Year': 1961,\n",
       "  'MaxTemperature': 6.2,\n",
       "  'MinTemperature': 1.0,\n",
       "  'Rainfall': 55.9,\n",
       "  'Sunlight': 50.5,\n",
       "  'MeanTemperature': 3.6},\n",
       " {'Year': 1962,\n",
       "  'MaxTemperature': 7.3,\n",
       "  'MinTemperature': 0.7,\n",
       "  'Rainfall': 62.3,\n",
       "  'Sunlight': 73.5,\n",
       "  'MeanTemperature': 4.0},\n",
       " {'Year': 1963,\n",
       "  'MaxTemperature': -0.1,\n",
       "  'MinTemperature': -5.7,\n",
       "  'Rainfall': 24.7,\n",
       "  'Sunlight': 58.0,\n",
       "  'MeanTemperature': -2.9},\n",
       " {'Year': 1964,\n",
       "  'MaxTemperature': 5.0,\n",
       "  'MinTemperature': -0.3,\n",
       "  'Rainfall': 18.7,\n",
       "  'Sunlight': 45.8,\n",
       "  'MeanTemperature': 2.35},\n",
       " {'Year': 1965,\n",
       "  'MaxTemperature': 6.1,\n",
       "  'MinTemperature': 0.9,\n",
       "  'Rainfall': 47.4,\n",
       "  'Sunlight': 78.3,\n",
       "  'MeanTemperature': 3.5},\n",
       " {'Year': 1966,\n",
       "  'MaxTemperature': 4.6,\n",
       "  'MinTemperature': 0.4,\n",
       "  'Rainfall': 29.6,\n",
       "  'Sunlight': 34.0,\n",
       "  'MeanTemperature': 2.5},\n",
       " {'Year': 1967,\n",
       "  'MaxTemperature': 7.1,\n",
       "  'MinTemperature': 2.0,\n",
       "  'Rainfall': 21.8,\n",
       "  'Sunlight': 71.9,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1968,\n",
       "  'MaxTemperature': 6.8,\n",
       "  'MinTemperature': 0.9,\n",
       "  'Rainfall': 37.2,\n",
       "  'Sunlight': 38.2,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 1969,\n",
       "  'MaxTemperature': 8.4,\n",
       "  'MinTemperature': 3.4,\n",
       "  'Rainfall': 58.9,\n",
       "  'Sunlight': 36.1,\n",
       "  'MeanTemperature': 5.9},\n",
       " {'Year': 1970,\n",
       "  'MaxTemperature': 6.3,\n",
       "  'MinTemperature': 1.4,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 30.3,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 1971,\n",
       "  'MaxTemperature': 7.1,\n",
       "  'MinTemperature': 2.0,\n",
       "  'Rainfall': 71.6,\n",
       "  'Sunlight': 39.6,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1972,\n",
       "  'MaxTemperature': 6.0,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 46.0,\n",
       "  'Sunlight': 48.6,\n",
       "  'MeanTemperature': 3.8},\n",
       " {'Year': 1973,\n",
       "  'MaxTemperature': 6.9,\n",
       "  'MinTemperature': 1.8,\n",
       "  'Rainfall': 14.8,\n",
       "  'Sunlight': 39.7,\n",
       "  'MeanTemperature': 4.35},\n",
       " {'Year': 1974,\n",
       "  'MaxTemperature': 0.0,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 46.2,\n",
       "  'Sunlight': 66.4,\n",
       "  'MeanTemperature': 0.0},\n",
       " {'Year': 1975,\n",
       "  'MaxTemperature': 10.1,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 51.9,\n",
       "  'Sunlight': 38.0,\n",
       "  'MeanTemperature': 7.0},\n",
       " {'Year': 1976,\n",
       "  'MaxTemperature': 8.3,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 29.2,\n",
       "  'Sunlight': 52.9,\n",
       "  'MeanTemperature': 5.7},\n",
       " {'Year': 1977,\n",
       "  'MaxTemperature': 5.3,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 45.7,\n",
       "  'Sunlight': 43.5,\n",
       "  'MeanTemperature': 2.95},\n",
       " {'Year': 1978,\n",
       "  'MaxTemperature': 5.9,\n",
       "  'MinTemperature': -0.7,\n",
       "  'Rainfall': 61.5,\n",
       "  'Sunlight': 39.6,\n",
       "  'MeanTemperature': 2.6},\n",
       " {'Year': 1979,\n",
       "  'MaxTemperature': 2.5,\n",
       "  'MinTemperature': -3.0,\n",
       "  'Rainfall': 42.8,\n",
       "  'Sunlight': 56.4,\n",
       "  'MeanTemperature': -0.25},\n",
       " {'Year': 1980,\n",
       "  'MaxTemperature': 5.6,\n",
       "  'MinTemperature': -0.2,\n",
       "  'Rainfall': 33.7,\n",
       "  'Sunlight': 65.0,\n",
       "  'MeanTemperature': 2.7},\n",
       " {'Year': 1981,\n",
       "  'MaxTemperature': 7.4,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 35.8,\n",
       "  'Sunlight': 50.4,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1982,\n",
       "  'MaxTemperature': 5.6,\n",
       "  'MinTemperature': -1.1,\n",
       "  'Rainfall': 35.2,\n",
       "  'Sunlight': 51.7,\n",
       "  'MeanTemperature': 2.25},\n",
       " {'Year': 1983,\n",
       "  'MaxTemperature': 9.5,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 36.6,\n",
       "  'Sunlight': 62.0,\n",
       "  'MeanTemperature': 6.7},\n",
       " {'Year': 1984,\n",
       "  'MaxTemperature': 6.9,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 61.9,\n",
       "  'Sunlight': 96.5,\n",
       "  'MeanTemperature': 3.75},\n",
       " {'Year': 1985,\n",
       "  'MaxTemperature': 3.4,\n",
       "  'MinTemperature': -2.2,\n",
       "  'Rainfall': 37.3,\n",
       "  'Sunlight': 40.7,\n",
       "  'MeanTemperature': 0.6},\n",
       " {'Year': 1986,\n",
       "  'MaxTemperature': 6.3,\n",
       "  'MinTemperature': 0.8,\n",
       "  'Rainfall': 50.2,\n",
       "  'Sunlight': 75.0,\n",
       "  'MeanTemperature': 3.55},\n",
       " {'Year': 1987,\n",
       "  'MaxTemperature': 2.8,\n",
       "  'MinTemperature': -2.1,\n",
       "  'Rainfall': 9.5,\n",
       "  'Sunlight': 44.5,\n",
       "  'MeanTemperature': 0.35},\n",
       " {'Year': 1988,\n",
       "  'MaxTemperature': 8.0,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 100.3,\n",
       "  'Sunlight': 58.1,\n",
       "  'MeanTemperature': 5.35},\n",
       " {'Year': 1989,\n",
       "  'MaxTemperature': 8.9,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 25.8,\n",
       "  'Sunlight': 73.7,\n",
       "  'MeanTemperature': 6.0},\n",
       " {'Year': 1990,\n",
       "  'MaxTemperature': 9.8,\n",
       "  'MinTemperature': 4.0,\n",
       "  'Rainfall': 43.8,\n",
       "  'Sunlight': 64.7,\n",
       "  'MeanTemperature': 6.9},\n",
       " {'Year': 1991,\n",
       "  'MaxTemperature': 6.2,\n",
       "  'MinTemperature': 1.2,\n",
       "  'Rainfall': 29.9,\n",
       "  'Sunlight': 75.6,\n",
       "  'MeanTemperature': 3.7},\n",
       " {'Year': 1992,\n",
       "  'MaxTemperature': 6.4,\n",
       "  'MinTemperature': 1.4,\n",
       "  'Rainfall': 67.8,\n",
       "  'Sunlight': 49.5,\n",
       "  'MeanTemperature': 3.9},\n",
       " {'Year': 1993,\n",
       "  'MaxTemperature': 9.6,\n",
       "  'MinTemperature': 2.9,\n",
       "  'Rainfall': 51.3,\n",
       "  'Sunlight': 39.8,\n",
       "  'MeanTemperature': 6.25},\n",
       " {'Year': 1994,\n",
       "  'MaxTemperature': 8.5,\n",
       "  'MinTemperature': 2.3,\n",
       "  'Rainfall': 70.5,\n",
       "  'Sunlight': 66.6,\n",
       "  'MeanTemperature': 5.4},\n",
       " {'Year': 1995,\n",
       "  'MaxTemperature': 0.0,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 86.5,\n",
       "  'Sunlight': 56.9,\n",
       "  'MeanTemperature': 0.0},\n",
       " {'Year': 1996,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 33.2,\n",
       "  'Sunlight': 21.9,\n",
       "  'MeanTemperature': 3.75},\n",
       " {'Year': 1997,\n",
       "  'MaxTemperature': 4.7,\n",
       "  'MinTemperature': -1.2,\n",
       "  'Rainfall': 11.6,\n",
       "  'Sunlight': 51.8,\n",
       "  'MeanTemperature': 1.75},\n",
       " {'Year': 1998,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.5,\n",
       "  'Rainfall': 48.1,\n",
       "  'Sunlight': 46.8,\n",
       "  'MeanTemperature': 5.3},\n",
       " {'Year': 1999,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 50.2,\n",
       "  'Sunlight': 68.6,\n",
       "  'MeanTemperature': 5.75},\n",
       " {'Year': 2000,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 1.8,\n",
       "  'Rainfall': 20.5,\n",
       "  'Sunlight': 78.6,\n",
       "  'MeanTemperature': 4.95},\n",
       " {'Year': 2001,\n",
       "  'MaxTemperature': 6.1,\n",
       "  'MinTemperature': 0.4,\n",
       "  'Rainfall': 47.2,\n",
       "  'Sunlight': 83.8,\n",
       "  'MeanTemperature': 3.25},\n",
       " {'Year': 2002,\n",
       "  'MaxTemperature': 8.9,\n",
       "  'MinTemperature': 2.6,\n",
       "  'Rainfall': 33.0,\n",
       "  'Sunlight': 48.8,\n",
       "  'MeanTemperature': 5.75},\n",
       " {'Year': 2003,\n",
       "  'MaxTemperature': 7.0,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 78.6,\n",
       "  'Sunlight': 53.0,\n",
       "  'MeanTemperature': 4.3},\n",
       " {'Year': 2004,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 69.6,\n",
       "  'Sunlight': 49.2,\n",
       "  'MeanTemperature': 5.4},\n",
       " {'Year': 2005,\n",
       "  'MaxTemperature': 9.2,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 28.3,\n",
       "  'Sunlight': 66.3,\n",
       "  'MeanTemperature': 6.15},\n",
       " {'Year': 2006,\n",
       "  'MaxTemperature': 7.0,\n",
       "  'MinTemperature': 1.5,\n",
       "  'Rainfall': 19.8,\n",
       "  'Sunlight': 48.8,\n",
       "  'MeanTemperature': 4.25},\n",
       " {'Year': 2007,\n",
       "  'MaxTemperature': 10.4,\n",
       "  'MinTemperature': 3.8,\n",
       "  'Rainfall': 68.5,\n",
       "  'Sunlight': 66.2,\n",
       "  'MeanTemperature': 7.1},\n",
       " {'Year': 2008,\n",
       "  'MaxTemperature': 10.3,\n",
       "  'MinTemperature': 3.8,\n",
       "  'Rainfall': 58.0,\n",
       "  'Sunlight': 63.2,\n",
       "  'MeanTemperature': 7.05},\n",
       " {'Year': 2009,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 0.2,\n",
       "  'Rainfall': 40.9,\n",
       "  'Sunlight': 46.2,\n",
       "  'MeanTemperature': 3.0},\n",
       " {'Year': 2010,\n",
       "  'MaxTemperature': 3.9,\n",
       "  'MinTemperature': -0.4,\n",
       "  'Rainfall': 46.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 1.75},\n",
       " {'Year': 2011,\n",
       "  'MaxTemperature': 6.8,\n",
       "  'MinTemperature': 2.2,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.5},\n",
       " {'Year': 2012,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 2.8,\n",
       "  'Rainfall': 39.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.95},\n",
       " {'Year': 2013,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 0.5,\n",
       "  'Rainfall': 39.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.15},\n",
       " {'Year': 2014,\n",
       "  'MaxTemperature': 9.2,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 103.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 6.15},\n",
       " {'Year': 2015,\n",
       "  'MaxTemperature': 8.0,\n",
       "  'MinTemperature': 1.3,\n",
       "  'Rainfall': 46.7,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.65},\n",
       " {'Year': 2016,\n",
       "  'MaxTemperature': 8.7,\n",
       "  'MinTemperature': 2.6,\n",
       "  'Rainfall': 49.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.65},\n",
       " {'Year': 2017,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 0.5,\n",
       "  'Rainfall': 48.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.6},\n",
       " {'Year': 2018,\n",
       "  'MaxTemperature': 8.5,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 47.4,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.45},\n",
       " {'Year': 2019,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 1.0,\n",
       "  'Rainfall': 22.1,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 2020,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 49.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 6.5},\n",
       " {'Year': 2021,\n",
       "  'MaxTemperature': 5.7,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 81.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.15},\n",
       " {'Year': 2022,\n",
       "  'MaxTemperature': 8.4,\n",
       "  'MinTemperature': 1.2,\n",
       "  'Rainfall': 16.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.8},\n",
       " {'Year': 2023,\n",
       "  'MaxTemperature': 8.7,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 31.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.2},\n",
       " {'Year': 2024,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 51.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.25}]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Retrieve all weather data for a specific month across all years:\n",
    "search_query = \"\"\"\n",
    "MATCH(y:Year)-[:HAS_MONTH]->(m:Month {name:'January'})\n",
    "RETURN y.year AS Year, m.Tmax AS MaxTemperature, m.Tmin AS MinTemperature, m.Rain AS Rainfall, m.Sun AS Sunlight, m.Tmean AS MeanTemperature\n",
    "ORDER BY y.year\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'year': 1989, 'AverageTemperature': 6.6}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Get the year with the highest average temperature for a specific month:\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year)-[:HAS_MONTH]->(m:Month {name: 'January'})\n",
    "RETURN y.year AS year , avg(m.Tmean) as AverageTemperature\n",
    "ORDER BY AverageTemperature DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'average_rainfall': 56.56363636363639}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "\n",
    "#Average temperature between two given years\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year)-[:HAS_MONTH]->(m:Month)\n",
    "WHERE y.year >= 1980 AND y.year <= 1990\n",
    "RETURN AVG(m.Rain) AS average_rainfall\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "llm = ChatGroq(\n",
    "    model = \"llama-3.1-70b-versatile\",\n",
    "    temperature = 0,\n",
    "    max_tokens = 2000\n",
    ")\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "system_message = \"\"\"\n",
    "\n",
    "You are interacting with a Neo4j graph database containing weather data structured as follows:\n",
    "\n",
    "Graph Structure:\n",
    "        Year Node (Year)\n",
    "        Properties:\n",
    "        year (Integer): \n",
    "\n",
    "        Month Node (Month)\n",
    "        Properties:\n",
    "        month (Integer): The numeric representation of the month (1 = January, 2 = February, ..., 12 = December).\n",
    "        name (String): The name of the month (e.g., \"January\", \"February\").\n",
    "        Tmax (Float): Maximum temperature recorded in the month.\n",
    "        Tmin (Float): Minimum temperature recorded in the month.\n",
    "        AF (Float): Number of air frosts in the month.\n",
    "        Rain (Float): Rainfall recorded in millimeters.\n",
    "        Sun (Float): Sunlight recorded in hours.\n",
    "        Tmean (Float): Mean temperature in the month.\n",
    "        Date (Date): Date representation (e.g., \"1963-01-01\").\n",
    "\n",
    "        Relationships:\n",
    "        HAS_MONTH: Connects Year nodes to their respective Month nodes.\n",
    "\n",
    "Task:\n",
    "        You are provided with a natural language query. Your goal is to:\n",
    "        Understand the user's intent: Identify what the user is asking for, such as retrieving data, finding averages, or comparing values, average between to given dates or months or years\n",
    "        Generate an appropriate Cypher query: Based on the graph structure and properties provided above, translate the user's natural language query into a Cypher query.\n",
    "        Return the Cypher query: Ensure the query is correctly formatted and accounts for all relevant properties.\n",
    "\n",
    "        Use logical operators like >= and <= for filtering node for between specific years, months or dtaes.DO NOT use range() for this\n",
    "        WHERE clauses should be used for property value comparisons \n",
    "        \n",
    "\n",
    "\n",
    "Examples of Natural Language Queries:\n",
    "        \"What was the average temperature in a given year on month?\"\n",
    "        \"Show me the month with the most rainfall in given year.\"\n",
    "        \"Get all the weather data for January across all years.\"\n",
    "        \"Which year had the highest average temperature in July?\"\n",
    "        \"what was the average temperature between two years or months or dates\"\n",
    "        \"what was the maximum temperature between two years or months or dates\"\n",
    "\n",
    "Given a natural language query, generate a Cypher query that accurately reflects the user's request,\n",
    "ensuring that any specific year mentioned in the query is directly translated into the Cypher query. For instance, \n",
    "if the user asks for data from 1991 or in 1991, the Cypher query should explicitly reference the year 1991 in the `MATCH` statement.\n",
    "if the user asks for data from january or in january or any other month, the Cypher query should explicitly reference the month anuary or month 1 in the `MATCH` statement.\n",
    "ALways give answer obtained from data and never give any suggestion or interpretation\n",
    "\n",
    "User question: {query}\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "prompt = ChatPromptTemplate.from_template(system_message)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "\n",
    "llm = ChatGroq(\n",
    "    model = \"llama-3.1-70b-versatile\",\n",
    "    temperature = 0,\n",
    "    max_tokens = 2000\n",
    ")\n",
    "\n",
    "\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True,  cypher_prompt = prompt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\n",
      "RETURN avg(m.Rain) AS average_rainfall\n",
      "\u001b[0m\n"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:419\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    418\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 419\u001b[0m     data \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mQuery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    420\u001b[0m     json_data \u001b[38;5;241m=\u001b[39m [r\u001b[38;5;241m.\u001b[39mdata() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:314\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    313\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 314\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_disabled_classifications\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    319\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    321\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:221\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[0m\n\u001b[0;32m    220\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 221\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:409\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    408\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 409\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    177\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m     \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:860\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    857\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[0;32m    858\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[0;32m    859\u001b[0m )\n\u001b[1;32m--> 860\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    861\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:370\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    369\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 370\u001b[0m     \u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    371\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:245\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    244\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 245\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError\u001b[38;5;241m.\u001b[39mhydrate(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[1;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[36], line 4\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[38;5;66;03m# giving wrong XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\u001b[39;00m\n\u001b[0;32m      2\u001b[0m question \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mwhat was average rain in between 1980 and 1990\u001b[39m\u001b[38;5;124m'\u001b[39m  \n\u001b[1;32m----> 4\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43mchain\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\u001b[43m{\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mquery\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m      5\u001b[0m response\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain\\chains\\base.py:164\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    162\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m    163\u001b[0m     run_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e)\n\u001b[1;32m--> 164\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m    165\u001b[0m run_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs)\n\u001b[0;32m    167\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m include_run_info:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain\\chains\\base.py:154\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    151\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m    152\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_validate_inputs(inputs)\n\u001b[0;32m    153\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m (\n\u001b[1;32m--> 154\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrun_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrun_manager\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    155\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m new_arg_supported\n\u001b[0;32m    156\u001b[0m         \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_call(inputs)\n\u001b[0;32m    157\u001b[0m     )\n\u001b[0;32m    159\u001b[0m     final_outputs: Dict[\u001b[38;5;28mstr\u001b[39m, Any] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(\n\u001b[0;32m    160\u001b[0m         inputs, outputs, return_only_outputs\n\u001b[0;32m    161\u001b[0m     )\n\u001b[0;32m    162\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\chains\\graph_qa\\cypher.py:341\u001b[0m, in \u001b[0;36mGraphCypherQAChain._call\u001b[1;34m(self, inputs, run_manager)\u001b[0m\n\u001b[0;32m    338\u001b[0m \u001b[38;5;66;03m# Retrieve and limit the number of results\u001b[39;00m\n\u001b[0;32m    339\u001b[0m \u001b[38;5;66;03m# Generated Cypher be null if query corrector identifies invalid schema\u001b[39;00m\n\u001b[0;32m    340\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m generated_cypher:\n\u001b[1;32m--> 341\u001b[0m     context \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mgenerated_cypher\u001b[49m\u001b[43m)\u001b[49m[: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mtop_k]\n\u001b[0;32m    342\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    343\u001b[0m     context \u001b[38;5;241m=\u001b[39m []\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:425\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    423\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m json_data\n\u001b[0;32m    424\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m CypherSyntaxError \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m--> 425\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mGenerated Cypher Statement is not valid\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;132;01m{\u001b[39;00me\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[1;31mValueError\u001b[0m: Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}"
     ]
    }
   ],
   "source": [
    "# giving wrong XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n",
    "question = 'what was average rain in between 1980 and 1990'  \n",
    "\n",
    "response = chain.invoke({\"query\": question})\n",
    "response\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\n",
      "RETURN avg(m.Tmean) AS average_temperature\n",
      "\u001b[0m\n"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:419\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    418\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 419\u001b[0m     data \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mQuery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    420\u001b[0m     json_data \u001b[38;5;241m=\u001b[39m [r\u001b[38;5;241m.\u001b[39mdata() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:314\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    313\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 314\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_disabled_classifications\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    319\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    321\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:221\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[0m\n\u001b[0;32m    220\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 221\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:409\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    408\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 409\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    177\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m     \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:860\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    857\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[0;32m    858\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[0;32m    859\u001b[0m )\n\u001b[1;32m--> 860\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    861\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:370\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    369\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 370\u001b[0m     \u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    371\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:245\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    244\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 245\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError\u001b[38;5;241m.\u001b[39mhydrate(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[1;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[37], line 4\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[38;5;66;03m# giving wrong XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\u001b[39;00m\n\u001b[0;32m      2\u001b[0m question \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mwhat was average temperature in between 1980 and 1990\u001b[39m\u001b[38;5;124m'\u001b[39m  \n\u001b[1;32m----> 4\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[43mchain\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\u001b[43m{\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mquery\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m      5\u001b[0m response\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain\\chains\\base.py:164\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    162\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m    163\u001b[0m     run_manager\u001b[38;5;241m.\u001b[39mon_chain_error(e)\n\u001b[1;32m--> 164\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m    165\u001b[0m run_manager\u001b[38;5;241m.\u001b[39mon_chain_end(outputs)\n\u001b[0;32m    167\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m include_run_info:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain\\chains\\base.py:154\u001b[0m, in \u001b[0;36mChain.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m    151\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m    152\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_validate_inputs(inputs)\n\u001b[0;32m    153\u001b[0m     outputs \u001b[38;5;241m=\u001b[39m (\n\u001b[1;32m--> 154\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_call\u001b[49m\u001b[43m(\u001b[49m\u001b[43minputs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrun_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrun_manager\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    155\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m new_arg_supported\n\u001b[0;32m    156\u001b[0m         \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_call(inputs)\n\u001b[0;32m    157\u001b[0m     )\n\u001b[0;32m    159\u001b[0m     final_outputs: Dict[\u001b[38;5;28mstr\u001b[39m, Any] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprep_outputs(\n\u001b[0;32m    160\u001b[0m         inputs, outputs, return_only_outputs\n\u001b[0;32m    161\u001b[0m     )\n\u001b[0;32m    162\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\chains\\graph_qa\\cypher.py:341\u001b[0m, in \u001b[0;36mGraphCypherQAChain._call\u001b[1;34m(self, inputs, run_manager)\u001b[0m\n\u001b[0;32m    338\u001b[0m \u001b[38;5;66;03m# Retrieve and limit the number of results\u001b[39;00m\n\u001b[0;32m    339\u001b[0m \u001b[38;5;66;03m# Generated Cypher be null if query corrector identifies invalid schema\u001b[39;00m\n\u001b[0;32m    340\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m generated_cypher:\n\u001b[1;32m--> 341\u001b[0m     context \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mgenerated_cypher\u001b[49m\u001b[43m)\u001b[49m[: \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mtop_k]\n\u001b[0;32m    342\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    343\u001b[0m     context \u001b[38;5;241m=\u001b[39m []\n",
      "File \u001b[1;32mc:\\Users\\Admin\\anaconda3\\envs\\myenv\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:425\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    423\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m json_data\n\u001b[0;32m    424\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m CypherSyntaxError \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m--> 425\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mGenerated Cypher Statement is not valid\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;132;01m{\u001b[39;00me\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[1;31mValueError\u001b[0m: Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '>=': expected an expression (line 2, column 22 (offset: 28))\n\"MATCH (y:Year {year: >= 1980 AND year: <= 1990})-[:HAS_MONTH]->(m:Month)\"\n                      ^}"
     ]
    }
   ],
   "source": [
    "# giving wrong XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n",
    "question = 'what was average temperature in between 1980 and 1990'  \n",
    "\n",
    "response = chain.invoke({\"query\": question})\n",
    "response\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (y:Year {year: range(1980, 1990)})-[:HAS_MONTH]->(m:Month)\n",
      "RETURN avg(m.Rain) AS average_rainfall\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'average_rainfall': None}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "verbose response is {'query': 'what was average rain in between 1980 and 1990', 'result': \"I don't know the answer.\"}\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "An error occurred: name 'chain' is not defined\n"
     ]
    }
   ],
   "source": [
    "import io\n",
    "\n",
    "import re\n",
    "from contextlib import redirect_stdout\n",
    "\n",
    "question = 'what was average temperature in december 1985'\n",
    "if question:\n",
    "    try:\n",
    "        f = io.StringIO() # create a place to capture output\n",
    "        with redirect_stdout(f):  # ouput(response) is redirected and sotored in f \n",
    "            response = chain.invoke({\"query\": question})\n",
    "        verbose_output = f.getvalue()\n",
    "        if verbose_output:\n",
    "            clean_output = re.sub(r'\\x1b\\[[0-9;]*m', '', verbose_output)\n",
    "            print(response)\n",
    "            print(clean_output)\n",
    "        else:\n",
    "            print(\"Could not extract Cypher query.\")\n",
    "    except Exception as e:\n",
    "        print(f\"An error occurred: {e}\")\n",
    "else:\n",
    "    print(\"Please enter a question.\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "myenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
