{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "weather_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///C:/Users/Admin/Desktop/WeatherRag/Data.csv' AS row\n",
    "WITH row,\n",
    "     split(row.Date, \"/\") AS dateParts\n",
    "CREATE (w:weatherDate {\n",
    "    Year: toInteger(row.Year),\n",
    "    Month: toInteger(row.Month),\n",
    "    Tmax: toFloat(row.Tmax),\n",
    "    Tmin: toFloat(row.Tmin),\n",
    "    AF: toFloat(row.AF),\n",
    "    Rain: toFloat(row.Rain),\n",
    "    Sun: toFloat(row.Sun),\n",
    "    Date: date(dateParts[2] + \"-\" + dateParts[1] + \"-\" + dateParts[0]),\n",
    "    Tmean: toFloat(row.Tmean)\n",
    "  \n",
    "})\n",
    "  RETURN row.Year\n",
    "    LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "graph.query(weather_query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "weather_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///C:/Users/Admin/Desktop/WeatherRag/Data.csv' AS row\n",
    "WITH row,\n",
    "   toInteger(coalesce(trim(row.Year), '0')) AS year,\n",
    "    toInteger(coalesce(trim(row.Month), '0')) AS month,\n",
    "    toFloat(coalesce(trim(row.Tmax), '0')) AS tmax,\n",
    "    toFloat(coalesce(trim(row.Tmin), '0')) AS tmin,\n",
    "    toFloat(coalesce(trim(row.AF), '0')) AS af,\n",
    "    toFloat(coalesce(trim(row.Rain), '0')) AS rain,\n",
    "    toFloat(coalesce(trim(row.Sun), '0')) AS sun,\n",
    "    split(coalesce(trim(row.Date), '01/01/1970'), \"/\") AS dateParts,\n",
    "    toFloat(coalesce(trim(row.Tmean), '0')) AS tmean\n",
    "\n",
    "MERGE (y:Year {year:year})\n",
    "MERGE (m:Month {month: month, name: CASE month\n",
    "    WHEN 1 THEN 'January' \n",
    "    WHEN 2 THEN 'February' \n",
    "    WHEN 3 THEN 'March' \n",
    "    WHEN 4 THEN 'April' \n",
    "    WHEN 5 THEN 'May' \n",
    "    WHEN 6 THEN 'June' \n",
    "    WHEN 7 THEN 'July' \n",
    "    WHEN 8 THEN 'August' \n",
    "    WHEN 9 THEN 'September' \n",
    "    WHEN 10 THEN 'October' \n",
    "    WHEN 11 THEN 'November' \n",
    "    WHEN 12 THEN 'December' \n",
    "    END,\n",
    "\n",
    "    Tmax: tmax,\n",
    "    Tmin: tmin,\n",
    "    AF: af,\n",
    "    Rain: rain,\n",
    "    Sun: sun,\n",
    "    Tmean: tmean,\n",
    "    Date: date(dateParts[2] + \"-\" + dateParts[1] + \"-\" + dateParts[0])\n",
    "\n",
    "    })\n",
    "\n",
    "MERGE (y)-[:HAS_MONTH]->(m)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "graph.query(weather_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SEARCH QUERIES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Month': 'January',\n",
       "  'MaxTemperature': -0.1,\n",
       "  'MinTemperature': -5.7,\n",
       "  'Rainfall': 24.7,\n",
       "  'Sunlight': 58.0,\n",
       "  'MeanTemperature': -2.9},\n",
       " {'Month': 'February',\n",
       "  'MaxTemperature': 1.2,\n",
       "  'MinTemperature': -3.5,\n",
       "  'Rainfall': 13.2,\n",
       "  'Sunlight': 59.0,\n",
       "  'MeanTemperature': -1.15},\n",
       " {'Month': 'March',\n",
       "  'MaxTemperature': 9.9,\n",
       "  'MinTemperature': 2.8,\n",
       "  'Rainfall': 50.3,\n",
       "  'Sunlight': 102.6,\n",
       "  'MeanTemperature': 6.35},\n",
       " {'Month': 'April',\n",
       "  'MaxTemperature': 13.4,\n",
       "  'MinTemperature': 4.7,\n",
       "  'Rainfall': 41.0,\n",
       "  'Sunlight': 124.9,\n",
       "  'MeanTemperature': 9.05},\n",
       " {'Month': 'May',\n",
       "  'MaxTemperature': 15.8,\n",
       "  'MinTemperature': 6.3,\n",
       "  'Rainfall': 43.5,\n",
       "  'Sunlight': 189.5,\n",
       "  'MeanTemperature': 11.05},\n",
       " {'Month': 'June',\n",
       "  'MaxTemperature': 20.6,\n",
       "  'MinTemperature': 10.0,\n",
       "  'Rainfall': 43.0,\n",
       "  'Sunlight': 201.8,\n",
       "  'MeanTemperature': 15.3},\n",
       " {'Month': 'July',\n",
       "  'MaxTemperature': 20.6,\n",
       "  'MinTemperature': 10.6,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 170.1,\n",
       "  'MeanTemperature': 15.6},\n",
       " {'Month': 'August',\n",
       "  'MaxTemperature': 19.0,\n",
       "  'MinTemperature': 10.6,\n",
       "  'Rainfall': 100.4,\n",
       "  'Sunlight': 119.6,\n",
       "  'MeanTemperature': 14.8},\n",
       " {'Month': 'September',\n",
       "  'MaxTemperature': 17.9,\n",
       "  'MinTemperature': 9.3,\n",
       "  'Rainfall': 44.1,\n",
       "  'Sunlight': 134.0,\n",
       "  'MeanTemperature': 13.6},\n",
       " {'Month': 'October',\n",
       "  'MaxTemperature': 14.3,\n",
       "  'MinTemperature': 8.0,\n",
       "  'Rainfall': 48.6,\n",
       "  'Sunlight': 78.4,\n",
       "  'MeanTemperature': 11.15},\n",
       " {'Month': 'November',\n",
       "  'MaxTemperature': 11.4,\n",
       "  'MinTemperature': 5.2,\n",
       "  'Rainfall': 78.6,\n",
       "  'Sunlight': 52.8,\n",
       "  'MeanTemperature': 8.3},\n",
       " {'Month': 'December',\n",
       "  'MaxTemperature': 5.0,\n",
       "  'MinTemperature': -0.7,\n",
       "  'Rainfall': 11.1,\n",
       "  'Sunlight': 48.7,\n",
       "  'MeanTemperature': 2.15}]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Get all weather data for a specific year:\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year {year: 1963})-[:HAS_MONTH]->(m:Month)\n",
    "RETURN m.name AS Month, m.Tmax AS MaxTemperature, m.Tmin AS MinTemperature, m.Rain AS Rainfall, m.Sun AS Sunlight, m.Tmean AS MeanTemperature\n",
    "ORDER BY m.month\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'month': 'August', 'Rainfall': 100.4}]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#maximum rain in a month of specific year\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year {year: 1963})-[:HAS_MONTH]->(m:Month)\n",
    "Return m.name as month, m.Rain as Rainfall \n",
    "ORDER BY m.Rain DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Year': 1963, 'AverageTemperature': 8.608333333333334}]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Calculate the average temperature for a specific year:\n",
    "search_query = \"\"\"\n",
    "MATCH(y:Year {year:1963})-[:HAS_MONTH]->(m:Month) \n",
    "return y.year As Year, avg(m.Tmean) AS AverageTemperature\n",
    "\"\"\"\n",
    "graph.query(search_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Year': 1959,\n",
       "  'MaxTemperature': 4.4,\n",
       "  'MinTemperature': -1.4,\n",
       "  'Rainfall': 0.0,\n",
       "  'Sunlight': 78.1,\n",
       "  'MeanTemperature': 1.5},\n",
       " {'Year': 1960,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 0.0,\n",
       "  'Sunlight': 36.3,\n",
       "  'MeanTemperature': 4.15},\n",
       " {'Year': 1961,\n",
       "  'MaxTemperature': 6.2,\n",
       "  'MinTemperature': 1.0,\n",
       "  'Rainfall': 55.9,\n",
       "  'Sunlight': 50.5,\n",
       "  'MeanTemperature': 3.6},\n",
       " {'Year': 1962,\n",
       "  'MaxTemperature': 7.3,\n",
       "  'MinTemperature': 0.7,\n",
       "  'Rainfall': 62.3,\n",
       "  'Sunlight': 73.5,\n",
       "  'MeanTemperature': 4.0},\n",
       " {'Year': 1963,\n",
       "  'MaxTemperature': -0.1,\n",
       "  'MinTemperature': -5.7,\n",
       "  'Rainfall': 24.7,\n",
       "  'Sunlight': 58.0,\n",
       "  'MeanTemperature': -2.9},\n",
       " {'Year': 1964,\n",
       "  'MaxTemperature': 5.0,\n",
       "  'MinTemperature': -0.3,\n",
       "  'Rainfall': 18.7,\n",
       "  'Sunlight': 45.8,\n",
       "  'MeanTemperature': 2.35},\n",
       " {'Year': 1965,\n",
       "  'MaxTemperature': 6.1,\n",
       "  'MinTemperature': 0.9,\n",
       "  'Rainfall': 47.4,\n",
       "  'Sunlight': 78.3,\n",
       "  'MeanTemperature': 3.5},\n",
       " {'Year': 1966,\n",
       "  'MaxTemperature': 4.6,\n",
       "  'MinTemperature': 0.4,\n",
       "  'Rainfall': 29.6,\n",
       "  'Sunlight': 34.0,\n",
       "  'MeanTemperature': 2.5},\n",
       " {'Year': 1967,\n",
       "  'MaxTemperature': 7.1,\n",
       "  'MinTemperature': 2.0,\n",
       "  'Rainfall': 21.8,\n",
       "  'Sunlight': 71.9,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1968,\n",
       "  'MaxTemperature': 6.8,\n",
       "  'MinTemperature': 0.9,\n",
       "  'Rainfall': 37.2,\n",
       "  'Sunlight': 38.2,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 1969,\n",
       "  'MaxTemperature': 8.4,\n",
       "  'MinTemperature': 3.4,\n",
       "  'Rainfall': 58.9,\n",
       "  'Sunlight': 36.1,\n",
       "  'MeanTemperature': 5.9},\n",
       " {'Year': 1970,\n",
       "  'MaxTemperature': 6.3,\n",
       "  'MinTemperature': 1.4,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 30.3,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 1971,\n",
       "  'MaxTemperature': 7.1,\n",
       "  'MinTemperature': 2.0,\n",
       "  'Rainfall': 71.6,\n",
       "  'Sunlight': 39.6,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1972,\n",
       "  'MaxTemperature': 6.0,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 46.0,\n",
       "  'Sunlight': 48.6,\n",
       "  'MeanTemperature': 3.8},\n",
       " {'Year': 1973,\n",
       "  'MaxTemperature': 6.9,\n",
       "  'MinTemperature': 1.8,\n",
       "  'Rainfall': 14.8,\n",
       "  'Sunlight': 39.7,\n",
       "  'MeanTemperature': 4.35},\n",
       " {'Year': 1974,\n",
       "  'MaxTemperature': 0.0,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 46.2,\n",
       "  'Sunlight': 66.4,\n",
       "  'MeanTemperature': 0.0},\n",
       " {'Year': 1975,\n",
       "  'MaxTemperature': 10.1,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 51.9,\n",
       "  'Sunlight': 38.0,\n",
       "  'MeanTemperature': 7.0},\n",
       " {'Year': 1976,\n",
       "  'MaxTemperature': 8.3,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 29.2,\n",
       "  'Sunlight': 52.9,\n",
       "  'MeanTemperature': 5.7},\n",
       " {'Year': 1977,\n",
       "  'MaxTemperature': 5.3,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 45.7,\n",
       "  'Sunlight': 43.5,\n",
       "  'MeanTemperature': 2.95},\n",
       " {'Year': 1978,\n",
       "  'MaxTemperature': 5.9,\n",
       "  'MinTemperature': -0.7,\n",
       "  'Rainfall': 61.5,\n",
       "  'Sunlight': 39.6,\n",
       "  'MeanTemperature': 2.6},\n",
       " {'Year': 1979,\n",
       "  'MaxTemperature': 2.5,\n",
       "  'MinTemperature': -3.0,\n",
       "  'Rainfall': 42.8,\n",
       "  'Sunlight': 56.4,\n",
       "  'MeanTemperature': -0.25},\n",
       " {'Year': 1980,\n",
       "  'MaxTemperature': 5.6,\n",
       "  'MinTemperature': -0.2,\n",
       "  'Rainfall': 33.7,\n",
       "  'Sunlight': 65.0,\n",
       "  'MeanTemperature': 2.7},\n",
       " {'Year': 1981,\n",
       "  'MaxTemperature': 7.4,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 35.8,\n",
       "  'Sunlight': 50.4,\n",
       "  'MeanTemperature': 4.55},\n",
       " {'Year': 1982,\n",
       "  'MaxTemperature': 5.6,\n",
       "  'MinTemperature': -1.1,\n",
       "  'Rainfall': 35.2,\n",
       "  'Sunlight': 51.7,\n",
       "  'MeanTemperature': 2.25},\n",
       " {'Year': 1983,\n",
       "  'MaxTemperature': 9.5,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 36.6,\n",
       "  'Sunlight': 62.0,\n",
       "  'MeanTemperature': 6.7},\n",
       " {'Year': 1984,\n",
       "  'MaxTemperature': 6.9,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 61.9,\n",
       "  'Sunlight': 96.5,\n",
       "  'MeanTemperature': 3.75},\n",
       " {'Year': 1985,\n",
       "  'MaxTemperature': 3.4,\n",
       "  'MinTemperature': -2.2,\n",
       "  'Rainfall': 37.3,\n",
       "  'Sunlight': 40.7,\n",
       "  'MeanTemperature': 0.6},\n",
       " {'Year': 1986,\n",
       "  'MaxTemperature': 6.3,\n",
       "  'MinTemperature': 0.8,\n",
       "  'Rainfall': 50.2,\n",
       "  'Sunlight': 75.0,\n",
       "  'MeanTemperature': 3.55},\n",
       " {'Year': 1987,\n",
       "  'MaxTemperature': 2.8,\n",
       "  'MinTemperature': -2.1,\n",
       "  'Rainfall': 9.5,\n",
       "  'Sunlight': 44.5,\n",
       "  'MeanTemperature': 0.35},\n",
       " {'Year': 1988,\n",
       "  'MaxTemperature': 8.0,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 100.3,\n",
       "  'Sunlight': 58.1,\n",
       "  'MeanTemperature': 5.35},\n",
       " {'Year': 1989,\n",
       "  'MaxTemperature': 8.9,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 25.8,\n",
       "  'Sunlight': 73.7,\n",
       "  'MeanTemperature': 6.0},\n",
       " {'Year': 1990,\n",
       "  'MaxTemperature': 9.8,\n",
       "  'MinTemperature': 4.0,\n",
       "  'Rainfall': 43.8,\n",
       "  'Sunlight': 64.7,\n",
       "  'MeanTemperature': 6.9},\n",
       " {'Year': 1991,\n",
       "  'MaxTemperature': 6.2,\n",
       "  'MinTemperature': 1.2,\n",
       "  'Rainfall': 29.9,\n",
       "  'Sunlight': 75.6,\n",
       "  'MeanTemperature': 3.7},\n",
       " {'Year': 1992,\n",
       "  'MaxTemperature': 6.4,\n",
       "  'MinTemperature': 1.4,\n",
       "  'Rainfall': 67.8,\n",
       "  'Sunlight': 49.5,\n",
       "  'MeanTemperature': 3.9},\n",
       " {'Year': 1993,\n",
       "  'MaxTemperature': 9.6,\n",
       "  'MinTemperature': 2.9,\n",
       "  'Rainfall': 51.3,\n",
       "  'Sunlight': 39.8,\n",
       "  'MeanTemperature': 6.25},\n",
       " {'Year': 1994,\n",
       "  'MaxTemperature': 8.5,\n",
       "  'MinTemperature': 2.3,\n",
       "  'Rainfall': 70.5,\n",
       "  'Sunlight': 66.6,\n",
       "  'MeanTemperature': 5.4},\n",
       " {'Year': 1995,\n",
       "  'MaxTemperature': 0.0,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 86.5,\n",
       "  'Sunlight': 56.9,\n",
       "  'MeanTemperature': 0.0},\n",
       " {'Year': 1996,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 33.2,\n",
       "  'Sunlight': 21.9,\n",
       "  'MeanTemperature': 3.75},\n",
       " {'Year': 1997,\n",
       "  'MaxTemperature': 4.7,\n",
       "  'MinTemperature': -1.2,\n",
       "  'Rainfall': 11.6,\n",
       "  'Sunlight': 51.8,\n",
       "  'MeanTemperature': 1.75},\n",
       " {'Year': 1998,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.5,\n",
       "  'Rainfall': 48.1,\n",
       "  'Sunlight': 46.8,\n",
       "  'MeanTemperature': 5.3},\n",
       " {'Year': 1999,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 50.2,\n",
       "  'Sunlight': 68.6,\n",
       "  'MeanTemperature': 5.75},\n",
       " {'Year': 2000,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 1.8,\n",
       "  'Rainfall': 20.5,\n",
       "  'Sunlight': 78.6,\n",
       "  'MeanTemperature': 4.95},\n",
       " {'Year': 2001,\n",
       "  'MaxTemperature': 6.1,\n",
       "  'MinTemperature': 0.4,\n",
       "  'Rainfall': 47.2,\n",
       "  'Sunlight': 83.8,\n",
       "  'MeanTemperature': 3.25},\n",
       " {'Year': 2002,\n",
       "  'MaxTemperature': 8.9,\n",
       "  'MinTemperature': 2.6,\n",
       "  'Rainfall': 33.0,\n",
       "  'Sunlight': 48.8,\n",
       "  'MeanTemperature': 5.75},\n",
       " {'Year': 2003,\n",
       "  'MaxTemperature': 7.0,\n",
       "  'MinTemperature': 1.6,\n",
       "  'Rainfall': 78.6,\n",
       "  'Sunlight': 53.0,\n",
       "  'MeanTemperature': 4.3},\n",
       " {'Year': 2004,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.7,\n",
       "  'Rainfall': 69.6,\n",
       "  'Sunlight': 49.2,\n",
       "  'MeanTemperature': 5.4},\n",
       " {'Year': 2005,\n",
       "  'MaxTemperature': 9.2,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 28.3,\n",
       "  'Sunlight': 66.3,\n",
       "  'MeanTemperature': 6.15},\n",
       " {'Year': 2006,\n",
       "  'MaxTemperature': 7.0,\n",
       "  'MinTemperature': 1.5,\n",
       "  'Rainfall': 19.8,\n",
       "  'Sunlight': 48.8,\n",
       "  'MeanTemperature': 4.25},\n",
       " {'Year': 2007,\n",
       "  'MaxTemperature': 10.4,\n",
       "  'MinTemperature': 3.8,\n",
       "  'Rainfall': 68.5,\n",
       "  'Sunlight': 66.2,\n",
       "  'MeanTemperature': 7.1},\n",
       " {'Year': 2008,\n",
       "  'MaxTemperature': 10.3,\n",
       "  'MinTemperature': 3.8,\n",
       "  'Rainfall': 58.0,\n",
       "  'Sunlight': 63.2,\n",
       "  'MeanTemperature': 7.05},\n",
       " {'Year': 2009,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 0.2,\n",
       "  'Rainfall': 40.9,\n",
       "  'Sunlight': 46.2,\n",
       "  'MeanTemperature': 3.0},\n",
       " {'Year': 2010,\n",
       "  'MaxTemperature': 3.9,\n",
       "  'MinTemperature': -0.4,\n",
       "  'Rainfall': 46.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 1.75},\n",
       " {'Year': 2011,\n",
       "  'MaxTemperature': 6.8,\n",
       "  'MinTemperature': 2.2,\n",
       "  'Rainfall': 52.4,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.5},\n",
       " {'Year': 2012,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 2.8,\n",
       "  'Rainfall': 39.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.95},\n",
       " {'Year': 2013,\n",
       "  'MaxTemperature': 5.8,\n",
       "  'MinTemperature': 0.5,\n",
       "  'Rainfall': 39.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.15},\n",
       " {'Year': 2014,\n",
       "  'MaxTemperature': 9.2,\n",
       "  'MinTemperature': 3.1,\n",
       "  'Rainfall': 103.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 6.15},\n",
       " {'Year': 2015,\n",
       "  'MaxTemperature': 8.0,\n",
       "  'MinTemperature': 1.3,\n",
       "  'Rainfall': 46.7,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.65},\n",
       " {'Year': 2016,\n",
       "  'MaxTemperature': 8.7,\n",
       "  'MinTemperature': 2.6,\n",
       "  'Rainfall': 49.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.65},\n",
       " {'Year': 2017,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 0.5,\n",
       "  'Rainfall': 48.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.6},\n",
       " {'Year': 2018,\n",
       "  'MaxTemperature': 8.5,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 47.4,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.45},\n",
       " {'Year': 2019,\n",
       "  'MaxTemperature': 6.7,\n",
       "  'MinTemperature': 1.0,\n",
       "  'Rainfall': 22.1,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.85},\n",
       " {'Year': 2020,\n",
       "  'MaxTemperature': 9.1,\n",
       "  'MinTemperature': 3.9,\n",
       "  'Rainfall': 49.8,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 6.5},\n",
       " {'Year': 2021,\n",
       "  'MaxTemperature': 5.7,\n",
       "  'MinTemperature': 0.6,\n",
       "  'Rainfall': 81.0,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 3.15},\n",
       " {'Year': 2022,\n",
       "  'MaxTemperature': 8.4,\n",
       "  'MinTemperature': 1.2,\n",
       "  'Rainfall': 16.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 4.8},\n",
       " {'Year': 2023,\n",
       "  'MaxTemperature': 8.7,\n",
       "  'MinTemperature': 1.7,\n",
       "  'Rainfall': 31.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.2},\n",
       " {'Year': 2024,\n",
       "  'MaxTemperature': 8.1,\n",
       "  'MinTemperature': 2.4,\n",
       "  'Rainfall': 51.6,\n",
       "  'Sunlight': 0.0,\n",
       "  'MeanTemperature': 5.25}]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Retrieve all weather data for a specific month across all years:\n",
    "search_query = \"\"\"\n",
    "MATCH(y:Year)-[:HAS_MONTH]->(m:Month {name:'January'})\n",
    "RETURN y.year AS Year, m.Tmax AS MaxTemperature, m.Tmin AS MinTemperature, m.Rain AS Rainfall, m.Sun AS Sunlight, m.Tmean AS MeanTemperature\n",
    "ORDER BY y.year\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'year': 2007, 'AverageTemperature': 7.1}]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Get the year with the highest average temperature for a specific month:\n",
    "search_query = \"\"\"\n",
    "MATCH (y:Year)-[:HAS_MONTH]->(m:Month {name: 'January'})\n",
    "RETURN y.year AS year , avg(m.Tmean) as AverageTemperature\n",
    "ORDER BY AverageTemperature DESC\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "graph.query(search_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "llm = ChatGroq(\n",
    "    model = \"llama-3.1-70b-versatile\",\n",
    "    temperature = 0,\n",
    "    max_tokens = 2000\n",
    ")\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "system_message = \"\"\"\n",
    "\n",
    "You are interacting with a Neo4j graph database containing weather data structured as follows:\n",
    "\n",
    "Graph Structure:\n",
    "        Year Node (Year)\n",
    "        Properties:\n",
    "        year (Integer): \n",
    "\n",
    "        Month Node (Month)\n",
    "        Properties:\n",
    "        month (Integer): The numeric representation of the month (1 = January, 2 = February, ..., 12 = December).\n",
    "        name (String): The name of the month (e.g., \"January\", \"February\").\n",
    "        Tmax (Float): Maximum temperature recorded in the month.\n",
    "        Tmin (Float): Minimum temperature recorded in the month.\n",
    "        AF (Float): Number of air frosts in the month.\n",
    "        Rain (Float): Rainfall recorded in millimeters.\n",
    "        Sun (Float): Sunlight recorded in hours.\n",
    "        Tmean (Float): Mean temperature in the month.\n",
    "        Date (Date): Date representation (e.g., \"1963-01-01\").\n",
    "\n",
    "        Relationships:\n",
    "        HAS_MONTH: Connects Year nodes to their respective Month nodes.\n",
    "\n",
    "Task:\n",
    "        You are provided with a natural language query. Your goal is to:\n",
    "            Understand the user's intent: Identify what the user is asking for, such as retrieving data, finding averages, or comparing values.\n",
    "            Generate an appropriate Cypher query: Based on the graph structure and properties provided above, translate the user's natural language query into a Cypher query.\n",
    "            Return the Cypher query: Ensure the query is correctly formatted and accounts for all relevant properties.\n",
    "\n",
    "Examples of Natural Language Queries:\n",
    "        \"What was the average temperature in a given year on month?\"\n",
    "        \"Show me the month with the most rainfall in given year.\"\n",
    "        \"Get all the weather data for January across all years.\"\n",
    "        \"Which year had the highest average temperature in July?\"\n",
    "\n",
    "Given a natural language query, generate a Cypher query that accurately reflects the user's request,\n",
    "ensuring that any specific year mentioned in the query is directly translated into the Cypher query. For instance, \n",
    "if the user asks for data from 1991 or in 1991, the Cypher query should explicitly reference the year 1991 in the `MATCH` statement.\n",
    "if the user asks for data from january or in january or any other month, the Cypher query should explicitly reference the month anuary or month 1 in the `MATCH` statement.\n",
    "ALwas gice answer obtained from data and never give any suggestion or interpretation\n",
    "\n",
    "User question: {query}\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "prompt = ChatPromptTemplate.from_template(system_message)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "graph = Neo4jGraph()\n",
    "\n",
    "\n",
    "llm = ChatGroq(\n",
    "    model = \"llama-3.1-70b-versatile\",\n",
    "    temperature = 0,\n",
    "    max_tokens = 2000\n",
    ")\n",
    "\n",
    "\n",
    "\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph, llm=llm, verbose=True,  cypher_prompt = prompt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (y:Year {year: 1985})-[:HAS_MONTH]->(m:Month {month: 12})\n",
      "RETURN avg(m.Rain) AS average_rainfall\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'average_rainfall': 73.1}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "verbose response is {'query': 'what was average rain in december 1985', 'result': \"I don't know the answer.\"}\n"
     ]
    }
   ],
   "source": [
    "question = 'what was average rain in december 1985'\n",
    "\n",
    "response = chain.invoke({\"query\": question})\n",
    "verbose_output = str(response)\n",
    "print('verbose response is',verbose_output)\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "An error occurred: name 'chain' is not defined\n"
     ]
    }
   ],
   "source": [
    "import io\n",
    "\n",
    "import re\n",
    "from contextlib import redirect_stdout\n",
    "\n",
    "question = 'what was average temperature in december 1985'\n",
    "if question:\n",
    "    try:\n",
    "        f = io.StringIO() # create a place to capture output\n",
    "        with redirect_stdout(f):  # ouput(response) is redirected and sotored in f \n",
    "            response = chain.invoke({\"query\": question})\n",
    "        verbose_output = f.getvalue()\n",
    "        if verbose_output:\n",
    "            clean_output = re.sub(r'\\x1b\\[[0-9;]*m', '', verbose_output)\n",
    "            print(response)\n",
    "            print(clean_output)\n",
    "        else:\n",
    "            print(\"Could not extract Cypher query.\")\n",
    "    except Exception as e:\n",
    "        print(f\"An error occurred: {e}\")\n",
    "else:\n",
    "    print(\"Please enter a question.\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "myenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
